#Спочатку просимо у користувача слова: | Іменник | Колір | Дієслово | Назва тварини | Назва місця |
im = input("Який іменник? \n")
col = input("Який колір? \n")
diya = input("Яке дієслово? \n")
tvar = input("Яка тварина? \n")
misc = input("Яке місце? \n")
pytannya = input("Хочете побачити історію? \n")

import random

stories = [
    f"Одного разу, відважний {im} вирушив у космос на пошуки {col} зірки. Під час подорожі він побачив, як {tvar} {diya} навколо {misc}. Це було настільки дивно, що {im} вирішив записати це у свій щоденник.",
    f"Сьогодні я вирішив приготувати особливий {im}. Щоб зробити його ідеальним, я додав {col} соус і попросив {tvar} {diya} його протягом десяти хвилин. На жаль, все пішло не за планом, і тепер misc виглядає так, ніби тут був вибух.",
    f"Ранок почався з того, що мій {im} вирішив {diya} на {col} хмаринці. Потім {tvar} прилетів і забрав його до {misc}. Я ніколи не думав, що такий звичайний день може бути настільки {col}.",
    f"Я знайшов старий {im} у {col} скрині, яка була захована в {misc}. Коли я відкрив її, звідти вискочив {tvar} і почав {diya}. Я був настільки здивований, що ледь не впустив {im}."
]

if pytannya == "так":
    chosen_story = random.choice(stories)
    print(f"Історія була так...\n {chosen_story}")
else: pytannya == "так"
print("Шкода")